// endings.js

var endings = [
	['ет', '(ет|ут|ют)'],
	['ёт', '(ет|ёт|ут|ют)'],
	['ут', '(ет|ут|ют)'],
	['ют', '(ет|ут|ют)'], // 1 спряжение

	['ит', '(ит|ат|ят)'],
	['ат', '(ит|ат|ят)'],
	['ят', '(ит|ат|ят)'], // 2 спряжение

	['ется', '(ет|ут|ют)ся'],
	['ётся', '(ет|ёт|ут|ют)ся'],
	['утся', '(ет|ут|ют)ся'],
	['ются', '(ет|ут|ют)ся'], // 1 спряжение, возвратные

	['ится', '(ит|ат|ят)ся'],
	['атся', '(ит|ат|ят)ся'],
	['ятся', '(ит|ат|ят)ся'], // 2 спряжение, возвратные

	['лся', '(лся|лась|лось|лись)'],
	['лась', '(лся|лась|лось|лись)'],
	['лось', '(лся|лась|лось|лись)'],
	['лись', '(лся|лась|лось|лись)'], // прошедшее время, возвратные

	['ал', '(ал|ала|ало|али)'],
	['ала', '(ал|ала|ало|али)'],
	['ало', '(ал|ала|ало|али)'],
	['али', '(ал|ала|ало|али)'], // прошедшее время

	['ел', '(ел|ела|ело|ели)'],
	['ела', '(ел|ела|ело|ели)'],
	['ело', '(ел|ела|ело|ели)'],
	['ели', '(ел|ела|ело|ели)'], // прошедшее время

	['ил', '(ил|ила|ило|или)'],
	['ила', '(ил|ила|ило|или)'],
	['ило', '(ил|ила|ило|или)'],
	['или', '(ил|ила|ило|или)'], // прошедшее время

	['л', '(л|ла|ло|ли)'],
	['ла', '(л|ла|ло|ли)'],
	['ло', '(л|ла|ло|ли)'],
	['ли', '(л|ла|ло|ли)'], // прошедшее время, общий случай

	['ен', 'ен'],
	['ена', 'ена'],
	['ено', 'ено'],
	['ены', 'ены'], // краткие прилагательные / причастия

	['ан', 'ан'],
	['ана', 'ана'],
	['ано', 'ано'],
	['аны', 'аны'], // краткие прилагательные / причастия

	['жен', 'жен'],
	['жна', 'жна'],
	['жно', 'жно'],
	['жны', 'жны'], // краткие прилагательные / причастия
]
